# Document Get Active Edit Mode Method

Source: https://www.revitapidocs.com/2026/b4eef1df-11b3-f5da-7082-87570a16383e.htm

---

| Document Get Active Edit Mode Method |
| --- |

Returns the document's active edit mode. Returns None if no edit mode is currently active.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public EditModeType GetActiveEditMode()
```

```
Public Function GetActiveEditMode As EditModeType
```

```
public:
EditModeType GetActiveEditMode()
```

```
member GetActiveEditMode : unit -> EditModeType
```

#### Return Value

EditModeType See Also

#### Reference

Document Class Autodesk.Revit.DB Namespace